integration_test/load_test/ccv-flow.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: https://mainnet-ccv.cardanoapi.io
  phases:
    - duration: 20
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 20
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 4
      rampTo: 30
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 500
      - http.response_time.p95: 400
  engines:
    playwright: {}
  # Path to JavaScript file that defines Playwright test functions
  processor: './flows.js'
scenarios:
  - engine: playwright
    testFunction:  visitPollFlow
  - engine: playwright
    testFunction: 'representativeFlow'